Revit 2026 API

# Transform1DOfVector Method

---

Applies the transformation to the 1-dimensional vector (a "tangent vector" on the real line) and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double OfVector(
	double vector
)
```
```vb
Public Function OfVector (
	vector As Double
) As Double
```
```cpp
public:
double OfVector(
	double vector
)
```
```fsharp
member OfVector :
        vector : float -> float
```

#### Parameters

vector Double
     The vector to transform.

#### Return Value

Double The transformed vector.

Transformation of a vector is not affected by the translational part of the transformation.

#### Reference

Transform1D Class

Autodesk.Revit.DB Namespace